cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'ansible'
brew 'battery'
brew 'brew-php-switcher'
brew 'browsertime'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'ctags-better-php'
brew 'curl'
brew 'ffmpeg'
brew 'flac'
brew 'freetype'
brew 'git-extras'
brew 'git-flow'
brew 'go'
brew 'grc'
brew 'gzip'
brew 'htop'
brew 'htop-osx'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'mas'
brew 'mariadb'
brew 'openssl'
brew 'node'
brew 'nvm'
brew 'neovim'
brew 'php56'
brew 'php56-apcu'
brew 'php56-xdebug'
brew 'php56-igbinary'
brew 'php56-memcached'
brew 'php56-opcache'
brew 'php56-xdebug'
brew 'php70'
brew 'php71'
brew 'python'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'readline'
brew 'rename'
brew 'resty'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'xdebug-osx'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'controlplane
cask 'filezilla'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-drive'
cask 'google-hangouts'
cask 'google-play-music-desktop-player'
cask 'handbrake'
cask 'imageoptim'
cask 'iterm2'
cask 'jumpcut'
cask 'karabiner-elements'
cask 'lastpass'
cask 'licecap'
cask 'onyx'
cask 'pocketcasts'
cask 'postman'
cask 'slack'
cask 'sequel-pro'
cask 'transmission'
cask 'tunnelbear'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

# Quicklook plugins
brew cask install qlcolorcode
brew cask install qlmarkdown
brew cask install qlstephen
brew cask install quicklook-json
brew cask install qlprettypatch
brew cask install quicklook-csv
brew cask install betterzipql
brew cask install webpquicklook
brew cask install suspicious-package



